cfd/GEO_A/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

convertToMeters 0.001;
vertices
(
(0 100 150)
(10 100 150)
(10 150 150)
(0 150 150)
(0 100 450)
(10 100 450)
(10 150 450)
(0 150 450)
(0 100 650)
(10 100 650)
(10 150 650)
(0 150 650)
(0 100 850)
(10 100 850)
(10 150 850)
(0 150 850)
(10 650 150)
(0 650 150)
(10 650 450)
(0 650 450)
(10 650 650)
(0 650 650)
(10 650 850)
(0 650 850)
(10 700 150)
(0 700 150)
(10 700 450)
(0 700 450)
(10 700 650)
(0 700 650)
(10 700 850)
(0 700 850)
(150 100 150)
(150 150 150)
(150 100 450)
(150 150 450)
(150 100 650)
(150 150 650)
(150 100 850)
(150 150 850)
(150 650 150)
(150 650 450)
(150 650 650)
(150 650 850)
(150 700 150)
(150 700 450)
(150 700 650)
(150 700 850)
(180 100 150)
(180 150 150)
(180 100 450)
(180 150 450)
(180 100 650)
(180 150 650)
(180 100 850)
(180 150 850)
(180 650 150)
(180 650 450)
(180 650 650)
(180 650 850)
(180 700 150)
(180 700 450)
(180 700 650)
(180 700 850)
(220 100 150)
(220 150 150)
(220 100 450)
(220 150 450)
(220 100 650)
(220 150 650)
(220 100 850)
(220 150 850)
(220 650 150)
(220 650 450)
(220 650 650)
(220 650 850)
(220 700 150)
(220 700 450)
(220 700 650)
(220 700 850)
(250 100 150)
(250 150 150)
(250 100 450)
(250 150 450)
(250 100 650)
(250 150 650)
(250 100 850)
(250 150 850)
(250 650 150)
(250 650 450)
(250 650 650)
(250 650 850)
(250 700 150)
(250 700 450)
(250 700 650)
(250 700 850)
(290 100 150)
(290 150 150)
(290 100 450)
(290 150 450)
(290 100 650)
(290 150 650)
(290 100 850)
(290 150 850)
(290 650 150)
(290 650 450)
(290 650 650)
(290 650 850)
(290 700 150)
(290 700 450)
(290 700 650)
(290 700 850)
(320 100 150)
(320 150 150)
(320 100 450)
(320 150 450)
(320 100 650)
(320 150 650)
(320 100 850)
(320 150 850)
(320 650 150)
(320 650 450)
(320 650 650)
(320 650 850)
(320 700 150)
(320 700 450)
(320 700 650)
(320 700 850)
(500 100 150)
(500 150 150)
(500 100 450)
(500 150 450)
(500 100 650)
(500 150 650)
(500 100 850)
(500 150 850)
(500 650 150)
(500 650 450)
(500 650 650)
(500 650 850)
(320 150 1600)
(500 150 1600)
(500 650 1600)
(320 650 1600)
(320 150 1850)
(500 150 1850)
(500 650 1850)
(320 650 1850)
(320 150 2000)
(500 150 2000)
(500 650 2000)
(320 650 2000)
(500 700 150)
(500 700 450)
(500 700 650)
(500 700 850)
(590 150 450)
(590 650 450)
(590 150 650)
(590 650 650)
(590 150 850)
(590 650 850)
(590 150 1600)
(590 650 1600)
(590 150 1850)
(590 650 1850)
(590 150 2000)
(590 650 2000)
(690 150 650)
(690 650 650)
(690 150 850)
(690 650 850)
(690 150 1600)
(690 650 1600)
(690 150 1850)
(690 650 1850)
(690 150 2000)
(690 650 2000)
(700 150 1600)
(700 650 1600)
(700 150 1850)
(700 650 1850)
);
blocks
(
hex (0 1 2 3 4 5 6 7) AIR_INLET (1 3 15) simpleGrading (1 1 1)
hex (4 5 6 7 8 9 10 11) AIR_INLET (1 3 10) simpleGrading (1 1 1)
hex (8 9 10 11 12 13 14 15) AIR_INLET (1 3 10) simpleGrading (1 1 1)
hex (3 2 16 17 7 6 18 19) AIR_INLET (1 25 15) simpleGrading (1 1 1)
hex (7 6 18 19 11 10 20 21) AIR_INLET (1 25 10) simpleGrading (1 1 1)
hex (11 10 20 21 15 14 22 23) AIR_INLET (1 25 10) simpleGrading (1 1 1)
hex (17 16 24 25 19 18 26 27) AIR_INLET (1 3 15) simpleGrading (1 1 1)
hex (19 18 26 27 21 20 28 29) AIR_INLET (1 3 10) simpleGrading (1 1 1)
hex (21 20 28 29 23 22 30 31) AIR_INLET (1 3 10) simpleGrading (1 1 1)
hex (1 32 33 2 5 34 35 6) DIRTY_PLENUM (7 3 15) simpleGrading (1 1 1)
hex (5 34 35 6 9 36 37 10) DIRTY_PLENUM (7 3 10) simpleGrading (1 1 1)
hex (9 36 37 10 13 38 39 14) DIRTY_PLENUM (7 3 10) simpleGrading (1 1 1)
hex (2 33 40 16 6 35 41 18) DIRTY_PLENUM (7 25 15) simpleGrading (1 1 1)
hex (6 35 41 18 10 37 42 20) DIRTY_PLENUM (7 25 10) simpleGrading (1 1 1)
hex (10 37 42 20 14 39 43 22) DIRTY_PLENUM (7 25 10) simpleGrading (1 1 1)
hex (16 40 44 24 18 41 45 26) DIRTY_PLENUM (7 3 15) simpleGrading (1 1 1)
hex (18 41 45 26 20 42 46 28) DIRTY_PLENUM (7 3 10) simpleGrading (1 1 1)
hex (20 42 46 28 22 43 47 30) DIRTY_PLENUM (7 3 10) simpleGrading (1 1 1)
hex (32 48 49 33 34 50 51 35) STAGE_01 (2 3 15) simpleGrading (1 1 1)
hex (34 50 51 35 36 52 53 37) STAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (36 52 53 37 38 54 55 39) STAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (33 49 56 40 35 51 57 41) STAGE_01 (2 25 15) simpleGrading (1 1 1)
hex (35 51 57 41 37 53 58 42) STAGE_01 (2 25 10) simpleGrading (1 1 1)
hex (37 53 58 42 39 55 59 43) STAGE_01 (2 25 10) simpleGrading (1 1 1)
hex (40 56 60 44 41 57 61 45) STAGE_01 (2 3 15) simpleGrading (1 1 1)
hex (41 57 61 45 42 58 62 46) STAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (42 58 62 46 43 59 63 47) STAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (48 64 65 49 50 66 67 51) INTERSTAGE_01 (2 3 15) simpleGrading (1 1 1)
hex (50 66 67 51 52 68 69 53) INTERSTAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (52 68 69 53 54 70 71 55) INTERSTAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (49 65 72 56 51 67 73 57) INTERSTAGE_01 (2 25 15) simpleGrading (1 1 1)
hex (51 67 73 57 53 69 74 58) INTERSTAGE_01 (2 25 10) simpleGrading (1 1 1)
hex (53 69 74 58 55 71 75 59) INTERSTAGE_01 (2 25 10) simpleGrading (1 1 1)
hex (56 72 76 60 57 73 77 61) INTERSTAGE_01 (2 3 15) simpleGrading (1 1 1)
hex (57 73 77 61 58 74 78 62) INTERSTAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (58 74 78 62 59 75 79 63) INTERSTAGE_01 (2 3 10) simpleGrading (1 1 1)
hex (64 80 81 65 66 82 83 67) STAGE_02 (2 3 15) simpleGrading (1 1 1)
hex (66 82 83 67 68 84 85 69) STAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (68 84 85 69 70 86 87 71) STAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (65 81 88 72 67 83 89 73) STAGE_02 (2 25 15) simpleGrading (1 1 1)
hex (67 83 89 73 69 85 90 74) STAGE_02 (2 25 10) simpleGrading (1 1 1)
hex (69 85 90 74 71 87 91 75) STAGE_02 (2 25 10) simpleGrading (1 1 1)
hex (72 88 92 76 73 89 93 77) STAGE_02 (2 3 15) simpleGrading (1 1 1)
hex (73 89 93 77 74 90 94 78) STAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (74 90 94 78 75 91 95 79) STAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (80 96 97 81 82 98 99 83) INTERSTAGE_02 (2 3 15) simpleGrading (1 1 1)
hex (82 98 99 83 84 100 101 85) INTERSTAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (84 100 101 85 86 102 103 87) INTERSTAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (81 97 104 88 83 99 105 89) INTERSTAGE_02 (2 25 15) simpleGrading (1 1 1)
hex (83 99 105 89 85 101 106 90) INTERSTAGE_02 (2 25 10) simpleGrading (1 1 1)
hex (85 101 106 90 87 103 107 91) INTERSTAGE_02 (2 25 10) simpleGrading (1 1 1)
hex (88 104 108 92 89 105 109 93) INTERSTAGE_02 (2 3 15) simpleGrading (1 1 1)
hex (89 105 109 93 90 106 110 94) INTERSTAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (90 106 110 94 91 107 111 95) INTERSTAGE_02 (2 3 10) simpleGrading (1 1 1)
hex (96 112 113 97 98 114 115 99) STAGE_03 (2 3 15) simpleGrading (1 1 1)
hex (98 114 115 99 100 116 117 101) STAGE_03 (2 3 10) simpleGrading (1 1 1)
hex (100 116 117 101 102 118 119 103) STAGE_03 (2 3 10) simpleGrading (1 1 1)
hex (97 113 120 104 99 115 121 105) STAGE_03 (2 25 15) simpleGrading (1 1 1)
hex (99 115 121 105 101 117 122 106) STAGE_03 (2 25 10) simpleGrading (1 1 1)
hex (101 117 122 106 103 119 123 107) STAGE_03 (2 25 10) simpleGrading (1 1 1)
hex (104 120 124 108 105 121 125 109) STAGE_03 (2 3 15) simpleGrading (1 1 1)
hex (105 121 125 109 106 122 126 110) STAGE_03 (2 3 10) simpleGrading (1 1 1)
hex (106 122 126 110 107 123 127 111) STAGE_03 (2 3 10) simpleGrading (1 1 1)
hex (112 128 129 113 114 130 131 115) CLEAN_PLENUM (9 3 15) simpleGrading (1 1 1)
hex (114 130 131 115 116 132 133 117) CLEAN_PLENUM (9 3 10) simpleGrading (1 1 1)
hex (116 132 133 117 118 134 135 119) CLEAN_PLENUM (9 3 10) simpleGrading (1 1 1)
hex (113 129 136 120 115 131 137 121) CLEAN_PLENUM (9 25 15) simpleGrading (1 1 1)
hex (115 131 137 121 117 133 138 122) CLEAN_PLENUM (9 25 10) simpleGrading (1 1 1)
hex (117 133 138 122 119 135 139 123) CLEAN_PLENUM (9 25 10) simpleGrading (1 1 1)
hex (119 135 139 123 140 141 142 143) CLEAN_RISER (9 25 38) simpleGrading (1 1 1)
hex (140 141 142 143 144 145 146 147) CLEAN_RISER (9 25 13) simpleGrading (1 1 1)
hex (144 145 146 147 148 149 150 151) CLEAN_RISER (9 25 8) simpleGrading (1 1 1)
hex (120 136 152 124 121 137 153 125) CLEAN_PLENUM (9 3 15) simpleGrading (1 1 1)
hex (121 137 153 125 122 138 154 126) CLEAN_PLENUM (9 3 10) simpleGrading (1 1 1)
hex (122 138 154 126 123 139 155 127) CLEAN_PLENUM (9 3 10) simpleGrading (1 1 1)
hex (131 156 157 137 133 158 159 138) TURN_STEP_01 (5 25 10) simpleGrading (1 1 1)
hex (133 158 159 138 135 160 161 139) TURN_STEP_01 (5 25 10) simpleGrading (1 1 1)
hex (135 160 161 139 141 162 163 142) CLEAN_RISER (5 25 38) simpleGrading (1 1 1)
hex (141 162 163 142 145 164 165 146) CLEAN_RISER (5 25 13) simpleGrading (1 1 1)
hex (145 164 165 146 149 166 167 150) CLEAN_RISER (5 25 8) simpleGrading (1 1 1)
hex (158 168 169 159 160 170 171 161) TURN_STEP_02 (5 25 10) simpleGrading (1 1 1)
hex (160 170 171 161 162 172 173 163) CLEAN_RISER (5 25 38) simpleGrading (1 1 1)
hex (162 172 173 163 164 174 175 165) CLEAN_RISER (5 25 13) simpleGrading (1 1 1)
hex (164 174 175 165 166 176 177 167) CLEAN_RISER (5 25 8) simpleGrading (1 1 1)
hex (172 178 179 173 174 180 181 175) AIR_OUTLET (1 25 13) simpleGrading (1 1 1)
);
edges ();
boundary
(
AIR_INLET
{
 type patch;
 faces
(
(0 4 7 3)
(4 8 11 7)
(8 12 15 11)
(3 7 19 17)
(7 11 21 19)
(11 15 23 21)
(17 19 27 25)
(19 21 29 27)
(21 23 31 29)
);
}
AIR_OUTLET
{
 type patch;
 faces
(
(178 179 181 180)
);
}
WALLS
{
 type wall;
 faces
(
(0 1 5 4)
(0 3 2 1)
(4 5 9 8)
(8 9 13 12)
(12 13 14 15)
(3 17 16 2)
(15 14 22 23)
(25 27 26 24)
(17 25 24 16)
(27 29 28 26)
(29 31 30 28)
(23 22 30 31)
(1 32 34 5)
(1 2 33 32)
(5 34 36 9)
(9 36 38 13)
(13 38 39 14)
(2 16 40 33)
(14 39 43 22)
(24 26 45 44)
(16 24 44 40)
(26 28 46 45)
(28 30 47 46)
(22 43 47 30)
(32 48 50 34)
(32 33 49 48)
(34 50 52 36)
(36 52 54 38)
(38 54 55 39)
(33 40 56 49)
(39 55 59 43)
(44 45 61 60)
(40 44 60 56)
(45 46 62 61)
(46 47 63 62)
(43 59 63 47)
(48 64 66 50)
(48 49 65 64)
(50 66 68 52)
(52 68 70 54)
(54 70 71 55)
(49 56 72 65)
(55 71 75 59)
(60 61 77 76)
(56 60 76 72)
(61 62 78 77)
(62 63 79 78)
(59 75 79 63)
(64 80 82 66)
(64 65 81 80)
(66 82 84 68)
(68 84 86 70)
(70 86 87 71)
(65 72 88 81)
(71 87 91 75)
(76 77 93 92)
(72 76 92 88)
(77 78 94 93)
(78 79 95 94)
(75 91 95 79)
(80 96 98 82)
(80 81 97 96)
(82 98 100 84)
(84 100 102 86)
(86 102 103 87)
(81 88 104 97)
(87 103 107 91)
(92 93 109 108)
(88 92 108 104)
(93 94 110 109)
(94 95 111 110)
(91 107 111 95)
(96 112 114 98)
(96 97 113 112)
(98 114 116 100)
(100 116 118 102)
(102 118 119 103)
(97 104 120 113)
(103 119 123 107)
(108 109 125 124)
(104 108 124 120)
(109 110 126 125)
(110 111 127 126)
(107 123 127 111)
(128 129 131 130)
(112 128 130 114)
(112 113 129 128)
(130 131 133 132)
(114 130 132 116)
(132 133 135 134)
(116 132 134 118)
(118 134 135 119)
(129 136 137 131)
(113 120 136 129)
(119 140 143 123)
(119 135 141 140)
(123 143 142 139)
(140 144 147 143)
(140 141 145 144)
(143 147 146 142)
(144 148 151 147)
(144 145 149 148)
(147 151 150 146)
(148 149 150 151)
(136 152 153 137)
(124 125 153 152)
(120 124 152 136)
(137 153 154 138)
(125 126 154 153)
(138 154 155 139)
(126 127 155 154)
(123 139 155 127)
(156 157 159 158)
(131 156 158 133)
(137 138 159 157)
(131 137 157 156)
(133 158 160 135)
(138 139 161 159)
(135 160 162 141)
(139 142 163 161)
(141 162 164 145)
(142 146 165 163)
(145 164 166 149)
(146 150 167 165)
(149 166 167 150)
(168 169 171 170)
(158 168 170 160)
(159 161 171 169)
(158 159 169 168)
(170 171 173 172)
(160 170 172 162)
(161 163 173 171)
(162 172 174 164)
(163 165 175 173)
(174 175 177 176)
(164 174 176 166)
(165 167 177 175)
(166 176 177 167)
(172 178 180 174)
(173 175 181 179)
(172 173 179 178)
(174 180 181 175)
);
}
);
mergePatchPairs ();
